let base64Strings =
  "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789/+=";
let unko64Words = [
  "ちんこ",
  "ちんぽ",
  "まんこ",
  "おまんこ",
  "ザーメン",
  "中出し",
  "肉便器",
  "フェラ",
  "クンニ",
  "アナル",
  "潮吹き",
  "精液",
  "愛液",
  "オナホ",
  "ビッチ",
  "淫乱",
  "レイプ",
  "肉塊",
  "腐乱",
  "死にたい",
  "鬱",
  "ぶさいく",
  "陰キャ",
  "ニート",
  "金玉",
  "クリトリス",
  "包茎",
  "亀頭",
  "射精",
  "顔射",
  "口淫",
  "イラマ",
  "ごっくん",
  "手淫",
  "足淫",
  "パイズリ",
  "乳首",
  "勃起",
  "雌豚",
  "雌犬",
  "輪姦",
  "凌辱",
  "孕ませ",
  "種付け",
  "膣内",
  "子宮",
  "恥垢",
  "陰毛",
  "肛門",
  "直腸",
  "先走り",
  "白濁",
  "マン汁",
  "涎",
  "腐肉",
  "蛆虫",
  "死体",
  "首吊り",
  "廃人",
  "陰嚢",
  "尿道",
  "包皮",
  "カウパー",
  "淫紋",
  "肉奴隷",
];

let splitChar = "と";

function encode(str) {
  try {
    let base64str = btoa(encodeURIComponent(str));
    let encodedText = "";
    [].forEach.call(base64str, (e) => {
      encodedText += unko64Words[base64Strings.indexOf(e)];
      encodedText += splitChar;
    });
    encodedText = encodedText.slice(0, encodedText.length - 1);
    return { isError: false, data: encodedText };
  } catch (e) {
    return {
      isError: true,
      data: "chinko64エラー.うまく排泄できません.変なものを食べた可能性があります.",
    };
  }
}

function decode(str) {
  try {
    let base64str = "";
    let decodedText = "";
    let temp = str.replace(/\r?\n/g, "").replace(/\r? /g, "").split(splitChar);
    for (let i = 0; i < temp.length; i++) {
      let index = unko64Words.indexOf(temp[i]);
      if (index == -1) {
        return {
          isError: true,
          data: "chinko64エラー.うまく排泄できません.うんこが途切れている可能性があります.",
        };
      }
      base64str += base64Strings[index];
    }
    decodedText = decodeURIComponent(atob(base64str));
    return { isError: false, data: decodedText };
  } catch (e) {
    return {
      isError: true,
      data: "chinko64エラー.うまく排泄できません.うんこが途切れている可能性があります.",
    };
  }
}

window.onload = function () {
  let encodeButton = document.getElementById("encodeButton");
  encodeButton.addEventListener("click", () => {
    let beforeEncodeText = document.getElementById("beforeEncodeText").value;
    let afterEncodeForm = document.getElementById("afterEncodeText");
    let encoded = encode(beforeEncodeText);

    if (encoded.isError) {
      afterEncodeForm.style.color = "red";
    } else {
      afterEncodeForm.style.color = "black";
    }

    afterEncodeForm.value = encoded.data;
  });

  let decodeButton = document.getElementById("decodeButton");
  decodeButton.addEventListener("click", () => {
    let beforeDecodeText = document.getElementById("beforeDecodeText").value;
    let afterDecodeForm = document.getElementById("afterDecodeText");
    let decoded = decode(beforeDecodeText);

    if (decoded.isError) {
      afterDecodeForm.style.color = "red";
    } else {
      afterDecodeForm.style.color = "black";
    }

    afterDecodeForm.value = decoded.data;
  });
};

//パイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラと亀頭とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とイラマとごっくんとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と肉便器と死体とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器と腐肉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と陰キャとパイズリと子宮と肉便器と金玉とパイズリと恥垢と恥垢とマン汁とパイズリと恥垢とパイズリと射精とパイズリと子宮とフェラと亀頭とパイズリと恥垢と恥垢と腐肉とパイズリと子宮と潮吹きと蛆虫とパイズリと恥垢と口淫と涎とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とイラマとごっくんとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器とマン汁とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器とマン汁とパイズリと恥垢と恥垢と涎とパイズリと恥垢と口淫とマン汁とパイズリと恥垢と口淫と首吊りとパイズリと恥垢と恥垢と腐肉とパイズリと恥垢と足淫と陰キャとパイズリと子宮と潮吹きと蛆虫とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と陰キャとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と肉便器と死体とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と陰キャとパイズリと子宮と肉便器と金玉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器と腐肉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と潮吹きと涎とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラとイラマとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と潮吹きと涎とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きとクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラと顔射とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラと亀頭とパイズリと恥垢と恥垢と涎とパイズリと恥垢とパイズリと亀頭とパイズリと恥垢とイラマと口淫とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と蛆虫とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とイラマと射精とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きとクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と潮吹きと死体とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きとクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きと金玉とパイズリと恥垢と恥垢と首吊りとパイズリと恥垢と口淫とクリトリスとパイズリと子宮と精液とごっくんとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と足淫と首吊りとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と腐肉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮とフェラと射精とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と陰キャとパイズリと子宮と肉便器と金玉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラと亀頭とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と足淫と金玉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と潮吹きと涎とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とパイズリとイラマとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮とフェラと顔射とパイズリと恥垢と恥垢と蛆虫とパイズリと恥垢とイラマと顔射とパイズリと子宮と潮吹きとニートとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫とクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と腐肉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮とフェラと射精とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と陰キャとパイズリと子宮と肉便器と金玉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とパイズリとごっくんとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きとクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とイラマと亀頭とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と蛆虫とパイズリと恥垢と恥垢と腐肉とパイズリと子宮と肉便器と首吊りとパイズリと子宮とフェラと射精とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と金玉とパイズリと子宮と潮吹きと金玉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫とマン汁とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢とイラマと亀頭とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器とマン汁とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと恥垢と口淫と蛆虫とパイズリと恥垢と恥垢と腐肉とパイズリと恥垢とイラマと口淫とパイズリと恥垢と口淫と首吊りとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と潮吹きとクリトリスとパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器とニートとパイズリと子宮と肉便器と腐肉とパイズリと恥垢と恥垢とクリトリスとパイズリと子宮と肉便器と陰キャとパイズリと子宮と肉便器と金玉
